Tekla Open API Reference for Tekla Structures 2025
Symbol.GetAxisAlignedBoundingBox Method
 Returns the bounding box of the symbol (rectangle format).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RectangleBoundingBox GetAxisAlignedBoundingBox()
Public Function GetAxisAlignedBoundingBox As RectangleBoundingBox
Return Value
Type: RectangleBoundingBox
The bounding box of the symbol.
Implements
IAxisAlignedBoundingBox.GetAxisAlignedBoundingBox()
See Also
Reference
Symbol Class
Tekla.Structures.Drawing Namespace